/*
Напишите программу:
1. Ввести первое число с клавиатуры и записать его в строковую переменную.
2. Ввести второе число с клавиатуры и сохранить его в целочисленную переменную типа int.
3. Сравнить 2 числа и вывести большее на экран
4. Выведите также меньшее число на экран, предварительно переконвертировать его в тип double.
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}