public class Main {
    public static void main(String[] args) {
        /* Задача №1_Первая программа
           Вывести на консоль текст “Hello World!”
        */
        System.out.println("Hello World!");
        /* Задача №2_Типы данных
           1. Создайте переменную типа с плавающей точкой с наибольшим диапазоном чисел. Присвойте ей произвольное дробное значение
           2. Создайте переменную целочисленного типа с наименьшим диапазоном чисел. Присвойте ей наибольшее возможное значение
        */
        double num1 = 1789054.7564;
        byte num2 = 127;
        System.out.println("Переменная типа doouble" + num1);
        System.out.println("Переменная типа byte" + num2);
    }
}
