/*
Напишите программу:

1. Пользователь вводит размер массива и данные с клавиатуры в массив типа double.

2. Посчитайте среднее арифметическое элементов массива.

3. После этого произведите вывод массива на экран, где каждый элемент массива умножается на среднее арифметическое
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}