/*
Напишите программу, где пользователь вводит данные с клавиатуры в матрицу,
а после этого произведите вывод первой строки матрицы на экран,
где каждый элемент умножается на 3. Размерность матрицы задается пользователем.
 */
public class Main {
    public static void main(String[] args) {

        System.out.println("Hello world!");
    }
}